app/controllers/session_controller.rb

  def create
    # id,user_id,token
    user = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "aashish_khullar@aol.com"], ["LIMIT", 1]]