app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uuid" = $1 LIMIT $2  [["uuid", "HqAOk-4yR-NKz5uBTkfJ8_Q5aXo"], ["LIMIT", 1]]
---
  def find
    @unique  = params[:uuid]
    @user = User.find_by(uuid: @unique)

INSERT INTO "users" ("name", "email", "phone", "password_digest", "confirmation_link", "created_at", "updated_at", "uuid") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.confirmation_link = confirmation_link!
    @user.uuid = unique_id!
    if @user.password == @user.password_confirmation
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."confirmation_link" = $1 LIMIT $2  [["confirmation_link", "aw-7xrtVgAUef1olNoUFZBzIeT0"], ["LIMIT", 1]]
UPDATE "users" SET "is_active" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_active", true], ["updated_at", 2016-10-07 08:25:59 UTC], ["id", 22]]
---
  def verify
        @link = params[:link]
        @user = User.find_by(confirmation_link: @link)
          if !@user.nil?
              if @user.is_active == false
                # @user.is_active = true
                @user.update_attribute(:is_active, true)

SELECT  "users".* FROM "users" WHERE "users"."uuid" = $1 LIMIT $2  [["uuid", "nEy_7-FuatxNTg5wr8ucpSUcMtA"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$VKRJ6O7x67zz1wRiN8a5kedhhstUwA94//UZcmPOTZipmPnkvun8u"], ["updated_at", 2016-10-14 07:27:19 UTC], ["id", 7]]
---
  def update
    @unique  = params[:uuid]
    @user = User.find_by(uuid: @unique)
    if !@user.nil?
        if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."uuid" = $1 LIMIT $2  [["uuid", "adOcBc1qHawJB8J9h-Alz9kWePE"], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 23]]
---
  def destroy
    @unique  = params[:uuid]
    @user = User.find_by(uuid: @unique)
    if !@user.nil?
      @user.destroy